#Увести номер фігури, увести потрібні дані та обчислити площу відповідної фігури: 1 - коло, 2 - прямокутник, 3 - трикутник (за трьома сторонами).
import math
print(f'''
В цій програмі ви можете дізнатися площі фігур за їх даними
===========================================================
1 - коло
2 - прямокутник
3 - трикутник
===========================================================
''')
choice = int(input('Введіть номер фігури: '))
if choice == 1:
    r = float(input('Введіть радіус кола: '))
    print(f'Площа кола радіусом {r}: {math.pi * pow(r, 2)}')
elif choice == 2:
    a,b = map(float, input('Введіть довжини прямокутника в сторонах а та б: ').split())
    print(f'Площа прямокутника довжинами a = {a}, b = {b}: {a * b}')
elif choice == 3:
    a,b,c = map(float, input('Введіть довжини трикутника в сторонах а, б та c: ').split())
    p = (a+b+c)/2
    print(f'Площа трикутника довжинами a = {a}, b = {b}, c = {c}: {math.sqrt(p*(p-a)*(p-b)*(p-c))}')
else:
    print('Вкажіть номер фігури в діапазоні від 1 до 3')