#Піратам вдалося справедливо розділили скарб із m золотих монет – кожен отримав частину відповідно до свого піратського рангу і стажу.
#Наймолодший пірат взяв одну монету, а кожен наступний пірат брав на одну монету більше, ніж попередній його колега.
#Коли останній пірат забрав свою долю, то ще лишилося n монет, які були закопані на "чорний день". Скільки було піратів?
coins , remainder = map(int, input().split())
fate = coins - remainder
next_pirate = 1
count_pirates = 0
while fate >= next_pirate:
    fate -= next_pirate
    count_pirates += 1
    next_pirate += 1
print(count_pirates)