#Петро часто забуває ввечорі ставити на підзарядку свій електросамокат.
#А вранці за n хвилин до вихоту до академії він ставить його на під зарядку знаючи, що на аккамуляторі залишилось p відсотків заряду.
#За умови, що перебуваючі на підзарядці за одну хвилину заряд збільщується на 0.5 відсотка.
#напишіть програму, яка порахує скільки заряду буде мати аккамулятор (не більше 100%) на момент коли Петру час виїжджати до академії.
minutes, percent = map(float, input().split())
while percent <= 100 and minutes > 0:
    minutes -= 1
    percent += 0.5
if percent > 100:
    percent = 100
if percent == int(percent):
    print(f"{percent}%")
else:
    print(f"{percent}%")