#Після завершення другого туру олімпіади з програмування участники олімпіади вирішили відмітити цю подію.
#З цією метою було замовлено один великий торт прямокутної форми. При цьому стіл, навколо якого зібрались участники був круглим.
#Звичайно, у них виникло питання, чи поміститься прямокутний торт на круглому столі так, щоб жодна частина торту не виходила за межі столу.
#Вам необхідно дати відповідь на це питання, знаючи розміри торту і радіус столу.
#Вхідні дані:
#Містить три натуральних числа: радіус столу r (1≤r≤1000), ширину торту w та довжину торту l (1≤w≤l≤1000).
#Вихідні дані:
#Виведіть слово "YES", якщо торт поміщається на столі, і слово "NO" у протилежному випадку.
import math
r, w, l = map(int, input('Enter the radius, width and length separated by space: ').split())

if r >= 1000 or w >= 1000 or l >= 1000:
    if r >= 1000:
        print('This radius is too big.')
    else:
        print('This cake is too big.')
    exit()

if r <= 0 or w <= 0 or l <= 0:
    if r <= 0:
        print('This radius is too small.')
    else:
        print('This cake is too small.')
    exit()

diameter = 2 * r
diagonal = math.hypot(w,l)
if diameter >= diagonal:
    print('YES')
else:
    print('NO')