#У одному з найбыльших магазинів нашого міста напередодні нового року було оголощено акцію. 
#При покупці трьох товарів ви оплачуєте віртість лише двох з них, а третій отримуєте у подарунок.
#Проте найголовніша умова цієї акції як завжди написана у примітці дрібним шрифтом - товари, за які буде відбуватись оплата, обирає не покупець, а касир.
#Зрозуміло, що він вибере найдорожчі. Ви вирішили скористатись цією акцією і придбати деякі товари.
#Напишіть програму, яка визначатиме скільки вам прийдеться заплатити за вибрані три товари.
#Вхідні данні
#У єдиноному рядку записано три невід'ємні цілі числа - ціни вибраних товарів.
#Вихідні данні
#Виведіть одне ціле число - найбільшу суму, яку може попросити касир за цю покупку, діючи за правилами оголошеної акції.
a, b, c = map(int, input("Вкажіть ціни вибраних товарів: ").split())
if a >= b and a >= c:
    if b >= c:
        print(a+b)
    else:
        print(a+c)
elif b >= a and b >= c:
    if a >= c:
        print(b+a)
    else:
        print(b+c)
elif c >= a and c >= b:
    if a >= b:
        print(c+a)
    else:
        print(c+b)