#В годину пік на зупинку одночасно під'їхали три маршрутних таксі, що йшли по одному маршруту, в які відразу набилися пасажири.
#Водії виявили, що кількість людей у різних маршрутках є різною, і вирішили пересадити частину пасажирів так, щоб у кожній маршрутці було порівну пасажирів.
#Потрібно визначити, яку найменшу кількість пасажирів доведеться при цьому пересадити.
#Вхідні данні
#Три натуральні числа, що не перевищують 100 - кількьсть пасажирів у першій, другій та третій маршрутках відповідно.
#Вихідні данні
#Одне число – найменшу кількість пасажирів, яку потрібно пересадити. Якщо це неможливо, виведіть слово IMPOSSIBLE.
a, b, c = map(int, input("Вкажіть кількість пасажирів у маршрутках через пробіл: ").split())
count = 0
if (a + b + c) % 3 != 0:
    print("IMPOSSIBLE")
else:
    avg = (a + b + c) // 3
    if a > avg:
        count += a - avg
    if b > avg:
        count += b - avg
    if c > avg:
        count += c - avg
    print(count)