#Жетон для однієї поїздки на метро коштує 4 грн.
#Якщо планується більше поїздок, то врешті, можна придбати проїзний квиток, ціна якого на 10 поїздок становить 30 грн.,
#на 50 – 125 грн.,а на 100 – 200 грн.
#Яку мінімальну суму потрібно витратити, щоб оплатити проїзд не менш, як m поїздок на метро?
m = int(input("Вкажіть кількість поїздок: "))
if m < 10:
    if m * 4 > 30:
        print(30)
    else:
        print(m * 4)
elif m < 50:
    cost30 = (m // 10) * 30
    if m % 10 != 0:
        cost30 += m % 10 * 4
    if cost30 > 125:
        print(125)
    else:
        print(cost30)
elif m < 100:
    cost125 = (m // 50) * 125
    if m % 50 != 0:
        cost125 += (m % 50 // 10) * 30
    if m % 50 % 10 != 0:
        cost125 += m % 50 % 10 * 4
    if cost125 > 200:
        print(200)
    else:
        print(cost125)
else:
    cost200 = (m // 100) * 200
    if m % 100 != 0:
        cost200 += (m % 100 // 50) * 125
    if m % 100 % 50 != 0:
        cost200 += (m % 100 % 50 // 10) * 30
    if m % 100 % 50 % 10 != 0:
        cost200 += (m % 100 % 50 % 10) * 4
    print(cost200)