#Розробіть програму, яка запитує у користувача довжину та ширину прямокутника два числа.
#Програма повинна обчислити:
#Периметр прямокутника.
#Площу прямокутника.
#Довжину діагоналі прямокутника.
import math
length = abs(round(float(input("Введіть довжину прямокутника: ")), 2))
width = abs(round(float(input("Введіть ширину прямокутника: ")), 2))
print(f"""
Периметр прямокутника: {(length + width) * 2:.2f}
Площа прямокутника: {length * width:.2f}
Довжина діагоналі прямокутника: {math.hypot(length, width):.2f}
""")