#Напишіть програму, яка запитує у користувача три числа. Програма повинна обчислити:
#Середнє арифметичне цих чисел.
#Абсолютне відхилення кожного числа від середнього арифметичного.
import math
num1 = float(input("Введіть перше число: "))
num2 = float(input("Введіть друге число: "))
num3 = float(input("Введіть третє число: "))
avg = (num1 + num2 + num3) / 3
print(f"""
Середнє арифметичне трох чисел: {avg:.2f}
Абсолютне відхилення кожного числа від середнього арифметичного: 
--> перше число: {abs(num1 - avg):.2f}
--> друге число: {abs(num2 - avg):.2f}
--> трете число: {abs(num3 - avg):.2f}
""")