#Дано значення двох моментів часу, що належать до однієї і тієї ж доби: години, хвилини і секунди для кожного з моментів часу. 
#Відомо, що другий момент часу настав не раніше першого. 
#Визначте скільки секунд пройшло між двома моментами часу.
#Вхідні дані:
#Програма на вхід отримує три цілих числа - години, хвилини, секунди, що задають перший момент часу і три цілих числа, що задають другий момент часу.
#Вихідні дані:
#Виведіть кількість секунд між цими моментами часу..
hour1 = abs(int(input("Введіть години першого моменту часу: ")))
minute1 = abs(int(input("Введіть хвилини першого моменту часу: ")))
second1 = abs(int(input("Введіть секунди першого моменту часу: ")))

hour2 = abs(int(input("Введіть години другого моменту часу: ")))
minute2 = abs(int(input("Введіть хвилини другого моменту часу: ")))
second2 = abs(int(input("Введіть секунди другого моменту часу: ")))

total_seconds = ((hour2 - hour1) * 3600) + ((minute2 - minute1) * 60) + (second2 - second1)
print(f"Кількість секунд між моментами часу: {total_seconds}")