#Вартість пляшки води, враховуючи вартість порожньої пляшки, становить 1 грн 20 коп., а вартість порожньої пляшки 20 коп.
#Скільки пляшок води можна випити на n грн, враховуючи, що порожні пляшки можна здавати, і на одержані гроші купувати нові пляшки води.
#Вода без пляшки не продається.

print("""
===============================================================
=                    Автомат "ПолтаваВода"                    =
=                                                             =
=       Прайс лист:                                           =
=  1. Пляшка води 1л -- 1грн. 20коп.                          =
=                                                             =
===============================================================
=  Зверніть увагу!                                            =
=  У вартість пляшки води входить вартість порожньої пляшки.  =
=  Порожні пляшки можна здавати.                              =
===============================================================
""")
budget = abs(float(input("Введіть бюджет в грн.: ")))
first_batch = budget // 1.20
remainder = budget % 1.20
empty_bottles = first_batch
extra_bottles = (empty_bottles * 0.20 + remainder) // 1.00
total_bottles = empty_bottles + extra_bottles
print(f"""
===============================================================
=  Ви купуєте {total_bottles} пляшок води.                                  =
===============================================================
""")